In [1]:
# https://pandas.pydata.org/docs/user_guide/merging.html

# Concat

In [2]:
import numpy as np
import pandas as pd

In [12]:
#simple stacking , not intelligent
#default is 0th axis

In [6]:
a = pd.read_csv('a.csv')

In [8]:
b = pd.read_csv('b.csv')

In [9]:
a

    A   B
0  10  20
1  30  40

In [10]:
b

    A   C
0  10  20
1  30  40

In [11]:
pd.concat([a,b])

    A     B     C
0  10  20.0   NaN
1  30  40.0   NaN
0  10   NaN  20.0
1  30   NaN  40.0

In [14]:
pd.concat([a,b],axis=0) #default axis is 0 ,it will stack one below the other

    A     B     C
0  10  20.0   NaN
1  30  40.0   NaN
0  10   NaN  20.0
1  30   NaN  40.0

In [15]:
pd.concat([a,b],axis=1) #changing the default axis from 0 to 1 , it will stack side by side

    A   B   A   C
0  10  20  10  20
1  30  40  30  40

In [16]:
# accessing the data after concat

In [18]:
data = pd.concat([a,b],axis=1)

In [19]:
type(data)

pandas.core.frame.DataFrame

In [21]:
data.loc[:]

    A   B   A   C
0  10  20  10  20
1  30  40  30  40

In [23]:
data.iloc[0:1]

    A   B   A   C
0  10  20  10  20

In [24]:
data.iloc[0:1,0:2]

    A   B
0  10  20

In [25]:
data.iloc[0:2,3:]

    C
0  20
1  40

In [27]:
pd.concat([a,b],axis=0)

    A     B     C
0  10  20.0   NaN
1  30  40.0   NaN
0  10   NaN  20.0
1  30   NaN  40.0

In [28]:
pd.concat([a,b],axis=0,join='inner') #only the intersection will be considered

    A
0  10
1  30
0  10
1  30

In [29]:
a

    A   B
0  10  20
1  30  40

In [30]:
b

    A   C
0  10  20
1  30  40

In [31]:
pd.concat([a,b],axis=0,join='outer')

    A     B     C
0  10  20.0   NaN
1  30  40.0   NaN
0  10   NaN  20.0
1  30   NaN  40.0